Revit 2024 API
ParameterTypeId.RebarShapeHookRotationAtStart Property
 "Hook Rotation At Start"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RebarShapeHookRotationAtStart { get; }
Visual Basic
Public Shared ReadOnly Property RebarShapeHookRotationAtStart As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RebarShapeHookRotationAtStart {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace